Revit 2027 API
FabricArea.GetBoundaryCurveIds Method
 Retrieves the identifiers of the set of curves forming the boundary of the Fabric Area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetBoundaryCurveIds()
Public Function GetBoundaryCurveIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetBoundaryCurveIds()
member GetBoundaryCurveIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 A collection of ElementIds of FabricAreaCurve elements.
Remarks
 Each ElementId in the collection is an Id of an Element of type CurveElem.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace